namespace CodeeloUI.Graphics
{
    public enum FormAnimateEffects : uint
    {
        СКОЛЬЖЕНИЕ_СПРАВА_НАЛЕВО = 0x00040000 | 0x00000002,
        СКОЛЬЖЕНИЕ_СЛЕВА_НАПРАВО = 0x00040000 | 0x00000001,
        СКОЛЬЖЕНИЕ_СВЕРХУ_ВНИЗ = 0x00040000 | 0x00000004,
        СКОЛЬЖЕНИЕ_СНИЗУ_ВВЕРХ = 0x00040000 | 0x00000008,
        СКОЛЬЖЕНИЕ_СВЕРХУ_НАПРАВО = 0x00040000 | 0x00000004 | 0x00000001,
        СКОЛЬЖЕНИЕ_СНИЗУ_НАПРАВО = 0x00040000 | 0x00000008 | 0x00000001,
        СКОЛЬЖЕНИЕ_СВЕРХУ_НАЛЕВО = 0x00040000 | 0x00000004 | 0x00000002,
        СКОЛЬЖЕНИЕ_СНИЗУ_НАЛЕВО = 0x00040000 | 0x00000008 | 0x00000002,
        РАСКРЫТИЕ_СКРЫТИЕ = 0x00000010,
        ПОЯВЛЕНИЕ_ЗАТУХАНИЕ = 0x00080000
    }
    
}